---
type: PaperSizeSet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# PaperSizeSet

`Autodesk.Revit.DB.PaperSizeSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PaperSizeSet | — | `public PaperSizeSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( PaperSize item )` |
| Method | Erase | — | `public virtual int Erase ( PaperSize item )` |
| Method | ForwardIterator | — | `public virtual PaperSizeSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( PaperSize item )` |
| Method | ReverseIterator | — | `public virtual PaperSizeSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |